INSERT INTO employee (login_id, password, employee_id, name, reset_vacation_date, total_vacation_count, is_admin, authority) VALUES
('jooyoung', 'jooyoung', 'R20210601', '최주영', '2021-06-21', 15, 0, 'USER'),
('gipyeong', 'gipyeong', 'R20210701', '정기평', '2021-07-05', 15, 1, 'ADMIN'),
('seokwon', 'seokwon', 'R20220201', '임석원', '2022-02-14', 15, 0, 'USER'),
('seoeun', 'seoeun', 'R20220202', '이서은', '2022-02-14', 15, 1, 'ADMIN');

INSERT INTO vacation_code (code, name, value) VALUES
('abs01', '연차', 1),
('abs02', '연차)오전반차', 0.5),
('abs03', '연차)오후반차', 0.5),
('abs04', '대체휴가', 0),
('abs05', '경조휴가', 0),
('abs06', '출산육아휴가', 0),
('abs07', '기타', 0),
('abs08', '전체연차', 1);

INSERT INTO vacation (code, start, end, content, approval_status, use_status, employee_id, rejection_content, cancellation_content) VALUES
1	('abs01', '2024-01-09', '2024-01-09', '개인 사정', 'W', 'U', 'R20210701', NULL, NULL),
2	('abs02', '2024-02-13', '2024-02-13', '졸업식', 'A', 'U', 'R20220202', NULL, NULL),
3	('abs01', '2024-02-15', '2024-02-15', '긴히 쓸 일이 있어용', 'R', 'U', 'R20210601', NULL, NULL),
4	('abs03', '2024-03-10', '2024-03-10', '저도 긴히 쓸 일이 있어용', 'C', 'U', 'R20220201', NULL, NULL),
5	('abs04', '2024-04-21', '2024-04-21', '생일자 조기 퇴근', 'W', 'U', 'R20210701', NULL, NULL),
6	('abs01', '2024-09-18', '2024-09-20', '저도 집에 가고 싶어요', 'R', 'U', 'R20210701', NULL, NULL),
7	('abs04', '2024-12-11', '2024-12-11', '아플 예정', 'C', 'U', 'R20210701', NULL, NULL),
8	('abs01', '2024-06-21', '2024-06-24', '해외 봉사', 'A', 'U', 'R20210701', NULL, NULL),
9	('abs01', '2024-07-22', '2024-07-26', '여름 휴가', 'W', 'U', 'R20220202', NULL, NULL),
10	('abs07', '2024-07-31', '2024-07-31', '생일자 조기 퇴근', 'A', 'U', 'R20220202', NULL, NULL),
11	('abs01', '2024-07-17', '2024-07-19', '여름 휴가', 'R', 'U', 'R20210701', '팀원 간 일정 조정 필요', NULL),
12	('abs01', '2024-07-08', '2024-07-10', '여름 휴가', 'W', 'U', 'R20210601', NULL, NULL),
13	('abs01', '2024-07-08', '2024-07-11', '여름 휴가', 'W', 'U', 'R20220201', NULL, NULL),
14	('abs07', '2024-06-10', '2024-06-10', '집에 가고 싶어요', 'C', 'U', 'R20220202', NULL, '죄송합니다');

INSERT INTO vacation_date (vacation_idx, date) VALUES
(1, '2024-01-09'),
(2, '2024-02-13'),
(3, '2024-02-15'),
(4, '2024-03-10'),
(5, '2024-04-21'),
(6, '2024-09-18'), (6, '2024-09-19'), (6, '2024-09-20'),
(7, '2024-12-11'),
(8, '2024-06-21'), (8, '2024-06-24'),
(9, '2024-07-22'), (9, '2024-07-23'), (9, '2024-07-24'), (9, '2024-07-25'), (9, '2024-07-26'),
(10, '2024-07-31'),
(11, '2024-07-17'), (11, '2024-07-18'), (11, '2024-07-19'),
(12, '2024-07-08'), (12, '2024-07-09'), (12, '2024-07-10'),
(13, '2024-07-08'), (13, '2024-07-09'), (13, '2024-07-10'), (13, '2024-07-11'),
(14, '2024-06-10');

INSERT INTO whole_vacation (idx, code, start, end, content, approval_status, use_status, employee_id, rejection_content, cancellation_content) VALUES
(1, 'abs08', '2024-06-07', '2024-06-07', '전체 연차) 현충일', 'A', 'U', NULL, NULL, NULL),
(2, 'abs08', '2024-08-16', '2024-08-16', '전체 연차) 광복절', 'A', 'U', NULL, NULL, NULL),
(3, 'abs08', '2024-10-04', '2024-10-04', '전체 연차) 개천절', 'A', 'U', NULL, NULL, NULL);

INSERT INTO whole_vacation_date (idx, vacation_idx, date) VALUES
(1, 1, '2024-06-07'),
(2, 2, '2024-08-16'),
(3, 3, '2024-10-04');
